{
 "version": "1.0",
 "truncation": null,
 "padding": null,
 "added_tokens": [
  {
   "id": 0,
   "content": "<eos>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 1,
   "content": "<bos>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 2,
   "content": "<|turn>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 3,
   "content": "<turn|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 4,
   "content": "<|tool>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 5,
   "content": "<tool|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 6,
   "content": "<|tool_call>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 7,
   "content": "<tool_call|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 8,
   "content": "<|tool_response>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 9,
   "content": "<tool_response|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 10,
   "content": "<|\"|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 11,
   "content": "<|channel>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  },
  {
   "id": 12,
   "content": "<channel|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": false,
   "special": true
  }
 ],
 "normalizer": null,
 "pre_tokenizer": {
  "type": "ByteLevel",
  "add_prefix_space": false,
  "trim_offsets": true,
  "use_regex": true
 },
 "post_processor": null,
 "decoder": {
  "type": "ByteLevel",
  "add_prefix_space": false,
  "trim_offsets": true,
  "use_regex": true
 },
 "model": {
  "type": "BPE",
  "dropout": null,
  "unk_token": null,
  "continuing_subword_prefix": null,
  "end_of_word_suffix": null,
  "fuse_unk": false,
  "byte_fallback": false,
  "vocab": {
   "<eos>": 0,
   "<bos>": 1,
   "<|turn>": 2,
   "<turn|>": 3,
   "<|tool>": 4,
   "<tool|>": 5,
   "<|tool_call>": 6,
   "<tool_call|>": 7,
   "<|tool_response>": 8,
   "<tool_response|>": 9,
   "<|\"|>": 10,
   "<|channel>": 11,
   "<channel|>": 12,
   "\u0120": 13,
   "!": 14,
   "\"": 15,
   "#": 16,
   "$": 17,
   "%": 18,
   "&": 19,
   "'": 20,
   "(": 21,
   ")": 22,
   "*": 23,
   "+": 24,
   ",": 25,
   "-": 26,
   ".": 27,
   "/": 28,
   "0": 29,
   "1": 30,
   "2": 31,
   "3": 32,
   "4": 33,
   "5": 34,
   "6": 35,
   "7": 36,
   "8": 37,
   "9": 38,
   ":": 39,
   ";": 40,
   "<": 41,
   "=": 42,
   ">": 43,
   "?": 44,
   "@": 45,
   "A": 46,
   "B": 47,
   "C": 48,
   "D": 49,
   "E": 50,
   "F": 51,
   "G": 52,
   "H": 53,
   "I": 54,
   "J": 55,
   "K": 56,
   "L": 57,
   "M": 58,
   "N": 59,
   "O": 60,
   "P": 61,
   "Q": 62,
   "R": 63,
   "S": 64,
   "T": 65,
   "U": 66,
   "V": 67,
   "W": 68,
   "X": 69,
   "Y": 70,
   "Z": 71,
   "[": 72,
   "\\": 73,
   "]": 74,
   "^": 75,
   "_": 76,
   "`": 77,
   "a": 78,
   "b": 79,
   "c": 80,
   "d": 81,
   "e": 82,
   "f": 83,
   "g": 84,
   "h": 85,
   "i": 86,
   "j": 87,
   "k": 88,
   "l": 89,
   "m": 90,
   "n": 91,
   "o": 92,
   "p": 93,
   "q": 94,
   "r": 95,
   "s": 96,
   "t": 97,
   "u": 98,
   "v": 99,
   "w": 100,
   "x": 101,
   "y": 102,
   "z": 103,
   "{": 104,
   "|": 105,
   "}": 106,
   "~": 107,
   "\u010a": 108
  },
  "merges": []
 }
}